/******************** (C) COPYRIGHT 2014 DammStanger *****************************************
**--------------文件信息----------------------------------------------------------
 * 文件名	：Quaternion.h
 * 描	述	：有关四元数的运算
 *                    
 * 实验平台	：FCU V1.0
 * 硬件连接	：
 * 版 	本	：V1.1.150503
 * 从属关系	：FCU_UCOSII150602_UCOSII2.91
 * 库版本	：ST3.0.0
 * 创建时间	：2014.12.28
 * 最后编辑	：2015.5.3
 **-------------------------------------------------------------------------------

 * 作	者	：Damm Stanger
 * 邮	箱	：dammstanger@qq.com
**********************************************************************************************/

#ifndef __QUATERNION_H_
#define __QUATERNION_H_

/****************************包含头文件*******************************************/
#include "stm32f10x.h"

#include "usart.h"

/****************************宏定义***********************************************/


/****************************结构体定义*******************************************/
typedef struct
{
	float X;
	float Y;
	float Z;
} ZHOUDATA;

typedef struct 
{
	float Q0;
	float Q1;
	float Q2;
	float Q3;
}Quatdef;

typedef struct 
{
	ZHOUDATA a;
	ZHOUDATA b;
	ZHOUDATA c;
}MATRIX_3_3;
/****************************变量声明*********************************************/
extern Quatdef Quat;
extern MATRIX_3_3 g_MxCnb;
/****************************函数声明*********************************************/
void Quaternion_rotation_matrix(void);
#endif
/******************* (C) COPYRIGHT 2014 DammStanger *****END OF FILE************/

