
/******************** (C) COPYRIGHT 2014 DammStanger *****************************************
**--------------文件信息----------------------------------------------------------
 * 文件名	：RCdata.h
 * 描	述	：对遥控的数据进行处理
 *                    
 * 实验平台	：FCUV1.0
 * 硬件连接	：
 * 版 	本	：V1.0
 * 库版本	：ST3.0.0
 * 创建时间	：2014.12.25
 * 最后编辑	：2014.12.25
 **-------------------------------------------------------------------------------

 * 作	者	：Damm Stanger
 * 邮	箱	：dammstanger@qq.com
**********************************************************************************/

#ifndef _RCDATA_H_
#define _RCDATA_H_
/****************************包含头文件*******************************************/
#include "stm32f10x.h"
#include "Project_cfg.h"

/****************************宏定义***********************************************/


/****************************结构体定义*******************************************/
typedef struct 
{
	u16 ROLL;
	u16 PITCH;
	u16 THROTTLE;
	u16 YAW;
	u16 CH5;
	u16 CH6;

}RC_DATA;


/****************************变量声明*********************************************/
extern RC_DATA Rc_Data_temp;
extern RC_DATA Rc_Data;
extern RC_DATA Rc_DataLast;
extern RC_DATA Rc_Orign;
/****************************函数声明*********************************************/


void RCDataProcess(void);

#endif
/******************* (C) COPYRIGHT 2014 DammStanger *****END OF FILE************/




