
/******************** (C) COPYRIGHT 2014 DammStanger *****************************************
**--------------文件信息----------------------------------------------------------
 * 文件名	：Sonar.h
 * 描	述	：对SR04测得的距离进行处理
 *                    
 * 实验平台	：FCUV1.0
 * 硬件连接	：
 * 版 	本	：V1.0
 * 库版本	：ST3.0.0
 * 创建时间	：2014.12.25
 * 最后编辑	：2014.12.25
 **-------------------------------------------------------------------------------

 * 作	者	：Damm Stanger
 * 邮	箱	：dammstanger@qq.com
**********************************************************************************/

#ifndef _SONAR_H_
#define _SONAR_H_
/****************************包含头文件*******************************************/
#include "stm32f10x.h"
#include "Project_cfg.h"

/****************************宏定义***********************************************/


/****************************结构体定义*******************************************/
typedef struct 
{
	u8 Hight_H;
	u8 Hight_L;
	u8 Hight_Vel_H;
	u8 Hight_Vel_L;
}SONAR_TRANS_PAK;
/****************************变量声明*********************************************/
extern SONAR_TRANS_PAK SR_Pakbuf;
extern u16 SonarHight;						//声呐所探测的高度值
extern u16 SonarHight_Raw;
extern u16 SonarHight_avr;
extern s16 SonarHightvel;					//高度变化率有符号
/****************************函数声明*********************************************/

void SonarDataProcess(void);					//T=60ms
void Sonar_DataUpdate(void);


#endif
/******************* (C) COPYRIGHT 2014 DammStanger *****END OF FILE************/




